driver-tests/bpelse/systemicqualities/Redelivery/RedeliveryRedirectToBP-503/RedeliveryRedirectToBPFail1Bpel/src/RedeliveryRedirectToBPFail1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="RedeliveryRedirectToBPFail1" targetNamespace="http://j2ee.netbeans.org/wsdl/RedeliveryRedirectToBPFail1"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/RedeliveryRedirectToBPFail1" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="RedeliveryRedirectToBPFail1OperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="RedeliveryRedirectToBPFail1OperationResponse">
        <part name="part2" type="xsd:string"/>
    </message>
    <portType name="RedeliveryRedirectToBPFail1PortType">
        <operation name="RedeliveryRedirectToBPFail1Operation">
            <input name="input1" message="tns:RedeliveryRedirectToBPFail1OperationRequest"/>
            <output name="output1" message="tns:RedeliveryRedirectToBPFail1OperationResponse"/>
        </operation>
    </portType>
    <binding name="RedeliveryRedirectToBPFail1Binding" type="tns:RedeliveryRedirectToBPFail1PortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="RedeliveryRedirectToBPFail1Operation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/RedeliveryRedirectToBPFail1"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/RedeliveryRedirectToBPFail1"/>
            </output>
        </operation>
    </binding>
    <service name="RedeliveryRedirectToBPFail1Service">
        <port name="RedeliveryRedirectToBPFail1Port" binding="tns:RedeliveryRedirectToBPFail1Binding">
            <soap:address location="http://localhost:${HttpDefaultPort}/RedeliveryRedirectToBPFail1Service/RedeliveryRedirectToBPFail1Port"/>
        </port>
    </service>
    <plnk:partnerLinkType name="RedeliveryRedirectToBPFail1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="RedeliveryRedirectToBPFail1PortTypeRole" portType="tns:RedeliveryRedirectToBPFail1PortType"/>
    </plnk:partnerLinkType>
</definitions>
