driver-tests/bpelse/systemicqualities/Redelivery/RedeliveryRedirectToBP-503/RedeliveryRedirectCompApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:red="http://j2ee.netbeans.org/wsdl/RedeliveryRedirectToBPFail1">
  <soapenv:Body>
    <red:RedeliveryRedirectToBPFail1Operation>
      <part1>Redirect Redelivery: Redirect to BP Fail</part1>
    </red:RedeliveryRedirectToBPFail1Operation>
  </soapenv:Body>
</soapenv:Envelope>